habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
    // STEP 3: Init FIFO Buffers for use with ADC3: ±VS rail, CH1 & CH2 Amp Monitor
    FIFO_NVS_Supply = Init_FIFO_Buffer(Buffer_NVS_Supply, SYSTEM_NVS_BUFFER_SIZE, 0);
    FIFO_PVS_Supply = Init_FIFO_Buffer(Buffer_PVS_Supply, SYSTEM_PVS_BUFFER_SIZE, 0);
    FIFO_CH1_AmpMon = Init_FIFO_Buffer(Buffer_CH1_AmpMon, CH1_AMP_MON_BUFFER_SIZE, 0);
    FIFO_CH2_AmpMon = Init_FIFO_Buffer(Buffer_CH2_AmpMon, CH2_AMP_MON_BUFFER_SIZE, 0);
    FIFO_CH1_VoltMon = Init_FIFO_Buffer(Buffer_CH1_VoltMon, CH1_VOLT_MON_BUFFER_SIZE, 0);
    FIFO_CH2_VoltMon = Init_FIFO_Buffer(Buffer_CH2_VoltMon, CH2_VOLT_MON_BUFFER_SIZE, 0);

    // STEP 4: Init RMS structures
    RMS_CH1_AmpMon = Init_RMS_Class(CH1_AmpMonBuffer, RMS_WINDOW_SIZE);
    RMS_CH2_AmpMon = Init_RMS_Class(CH2_AmpMonBuffer, RMS_WINDOW_SIZE);
    RMS_CH1_VoltMon = Init_RMS_Class(CH1_VoltMonBuffer, RMS_WINDOW_SIZE);
    RMS_CH2_VoltMon = Init_RMS_Class(CH2_VoltMonBuffer, RMS_WINDOW_SIZE);

    // STEP 5: Init PID structures
    ArbPwrBooster.CH1.PID = Init_PID_Controller(PID_Pk, PID_Pi, PID_Pd, MCP45HVX1_POT_FULL_RESOLUTION);
    ArbPwrBooster.CH2.PID = Init_PID_Controller(PID_Pk, PID_Pi, PID_Pd, MCP45HVX1_POT_FULL_RESOLUTION);

} // END OF Init_ADC_Hardware



/********************************************************************************************************
* @brief Start Conversions for both ADC1 and ADC3.  Note this function should be call only once as part of
* the start up process.  Though ADC1 is configured in single shot mode and the start can be called on the
* completion of every ADC1 conversion, ADC3 is configured in circular mode and does not (should not) be called
* repeatedly as the conversions will automatically restart.
*
* @author original: Hab Collector \n
*
* @note: ADC1 is configured in single shot mode and its conversion rate is based on the rate at which it is called
* @note: ADC3 is configured in circular mode and will automatically restart the conversions
*
* STEP 1: Start ADC 1 & ADC 3 conversion all channels
********************************************************************************************************/
void ADC13_StartConversion(void)
{
    HAL_StatusTypeDef ADC_InitStatus = HAL_OK;

    // STEP 1: Start ADC 1 & ADC 3 conversion all channels
    ADC_InitStatus |= HAL_ADC_Start_DMA(&hadc1, (uint32_t *)ADC1_CountValue, ADC1_NUMBER_OF_CHANNELS);
    ADC_InitStatus |= HAL_ADC_Start_DMA(&hadc3, (uint32_t *)ADC3_CountValue, ADC3_NUMBER_OF_CHANNELS);
    if (ADC_InitStatus != HAL_OK)
        systemErrorHandler(__FILE__, __LINE__, 0, "Failed to init ADC peripheral");

} // END OF ADC13_StartConversion



/********************************************************************************************************
* @brief Redefinition of the weak callback function for ADC conversion complete.  ADC1 and ADC3 values
* have been acquired this function updates the corresponding FIFO buffers and calls a unique function that
* performs the channel conversion.
*
* ADC1 handles:
*    Temperature
*    3.3V measurement
* ADC3 handles:
*    -VS Supply Rail
*    +VS Supply Rail
*    CH1 Current Monitor
*    CH2 Current Monitor
*    CH1 Voltage Monitor
*    CH2 Voltage Monitor
*
* ADC1 Configuration
* RANK  ADC_CH  Port    Cycles  Net Name
* 1     Temp    NA      480     NA - Internal to IC
* 2     Vref    NA      480     NA - Internal to IC
*
* ADC3 Configuration:
* RANK  ADC_CH  Port    Cycles  Net Name
* 1     6       PF8     144     -VS_MON
* 2     7       PF9     144     +VS-MON
* 3     0       PA0     144     IO_MON_1
* 4     8       PF10    144     IO_MON_2
* 5     4       PF6     144     VI_MON_2
* 6     5       PF7     144     VI_MON_1
*
* ADC uses PCLK2 (108MHz) with a divisor of 8
*
* @author original: Hab Collector \n
*
* @note: This is redefinition - this function is define weak in the HAL but implemented here
* @note: The Rate toggle outputs are used to verify ADC conversion rate.  Conversion rate is calculated as:
* PCLK2 / ADC_Clock_Presclar * Total Conversion Cycles For All ADC_Channels
* @note: ADC3 conversion time = 64.00us or 15.625KHz (This is the sampling frequency)
* @note: ADC1 conversion time = 71.11us but the sample rate is governed by mainUpdateTaskActions() / GUI_UPDATE_RATE
* @note: As the sampling frequency is 15.63KHz the max frequency of the input signal (nyquist) 7.813KHz
* @note: The sampling frequency was limited by the Touch GFX - As this computation must take place periodically and
* outside of a task, faster sampling frequencies (for example 20KHz) could not be sustained without crashing the TouchGFX
* That said there is some room to possibly tweak this a little higher.  If only the channel current is being
* calculated for RMS you can definitely run at 20KHz sampling.  However the 15.63KHz sample is adjusted for
* both channels current and voltage monitoring RMS.
*
* @param hadc: Pointer to the ADC handler (ADC1 or ADC3)
*
* STEP 1: ADC1 Conversions: Micro-Temp Sensor, System 3.3V
* STEP 2: ADC3 Conversions: ±VS rail, CH1 & CH2 Amp Monitor
********************************************************************************************************/
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    // STEP 1: ADC1 Conversions: Micro-Temp Sensor, System 3.3V
    if (hadc == &hadc1)
    {
        // System Temperature: See section 15.10 of STM32F746 Reference Manual (RM0385)
        writeTo_FIFO_Buffer(FIFO_SystemTemp, ADC1_CountValue[RANK_1]);
        ArbPwrBooster.SystemMeasure.TempDegreeC = calculateSystemTemp();
        // System 3.3V
        writeTo_FIFO_Buffer(FIFO_System_3V3, ADC1_CountValue[RANK_2]);
        System_ADC_Reference = calculateSystem_3V3();
        ArbPwrBooster.SystemMeasure.VDD_VDREF = System_ADC_Reference;
        // Stop the one shot ADC - it must be started
        HAL_ADC_Stop_DMA(&hadc1);
        // Toggle at the end of conversion - for testing: ADC1 actual conversion rate versus calculated - using here ADC3_C_RATE_TOGGLE() must comment out its use in step 2
        // ADC3_C_RATE_TOGGLE();
    }

    // STEP 2: ADC3 Conversions: ±VS rail, CH1 & CH2 Amp Monitor, CH1 & CH2 Volt Monitor
    if (hadc == &hadc3)
    {
        // -VS Supply Rail
        writeTo_FIFO_Buffer(FIFO_NVS_Supply, ADC3_CountValue[RANK_1]);
        ArbPwrBooster.SystemMeasure.Negative_VS = calculateSystemSupply(FIFO_NVS_Supply, ADC_PVS_OFFSET_ERROR, ADC_PVS_GAIN_ERROR) * -1.0;
        // +VS Supply Rail
        writeTo_FIFO_Buffer(FIFO_PVS_Supply, ADC3_CountValue[RANK_2]);
        ArbPwrBooster.SystemMeasure.Positive_VS = calculateSystemSupply(FIFO_PVS_Supply, ADC_NVS_OFFSET_ERROR, ADC_NVS_GAIN_ERROR);
        // Current Monitor CH1
        writeTo_FIFO_Buffer(FIFO_CH1_AmpMon, ADC3_CountValue[RANK_3]);
        calculateChannelCurrent(ADC3_CountValue[RANK_3], FIFO_CH1_AmpMon, &ArbPwrBooster.CH1, RMS_CH1_AmpMon, ADC_IMON1_OFFSET_ERROR, ADC_IMON1_GAIN_ERROR);
        // Current Monitor CH2
        writeTo_FIFO_Buffer(FIFO_CH2_AmpMon, ADC3_CountValue[RANK_4]);
        calculateChannelCurrent(ADC3_CountValue[RANK_4], FIFO_CH2_AmpMon, &ArbPwrBooster.CH2, RMS_CH2_AmpMon, ADC_IMON2_OFFSET_ERROR, ADC_IMON2_GAIN_ERROR);
        // Voltage Monitor CH1
        writeTo_FIFO_Buffer(FIFO_CH1_VoltMon, ADC3_CountValue[RANK_6]);
        calculateChannelVoltage(ADC3_CountValue[RANK_6], FIFO_CH1_VoltMon, &ArbPwrBooster.CH1, RMS_CH1_VoltMon, ADC_VMON1_OFFSET_ERROR, ADC_VMON1_GAIN_ERROR);
        // Voltage Monitor CH2
        writeTo_FIFO_Buffer(FIFO_CH2_VoltMon, ADC3_CountValue[RANK_5]);
        calculateChannelVoltage(ADC3_CountValue[RANK_5], FIFO_CH2_VoltMon, &ArbPwrBooster.CH2, RMS_CH2_VoltMon, ADC_VMON2_OFFSET_ERROR, ADC_VMON2_GAIN_ERROR);
        // Toggle at the end of conversion - for testing: ADC3 actual conversion rate versus calculated
        ADC3_C_RATE_TOGGLE();
    }

