habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
} // END OF calculateSystemTemp



/********************************************************************************************************
* @brief Calculates the SYSTEM ±VS supply rail voltage.  The negative supply rail is inverted externally so it is
* read here as a positive value.  If the calling function is passing the negative supply rail FIFO it must
* also multiply the return value by -1.
*
* An ADC offset error and gain error are channel specific measurements that are made to improve the overall
* accuracy of the ADC count reading.  The offset error is measure in ADC counts when the input to the ADC
* is at GND - ideally it should be 0, but if not, this is how many counts the ADC is offset by and therefore
* must be subtracted out.  The gain error relates more to quantization effects of the ADC.  It is measure at the
* highest ADC input possible (System Reference Voltage if possible, but certainly as large as you can get)
* and its value should ideally be 4096 (12b ADC) if input is System Reference Voltage or the expected calculated
* value. The Gain Error (GE) is calculated as Measured / Expected - no gain error would be a value of 1.0
*
* @author original: Hab Collector \n
*
* @note: External divider ratio of .110 (30V to 3.3V)
* @note: Divider ratio for ±VS is the same
* @note: Nominal supply voltage is 15V
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @param FIFO_SupplyRail FIFO struct associated with specific supply voltage channel
* @param InputOffsetError: ADC Input offset error as measured at ADC input for +VS or -VS
* @param GainError: ADC Gain error measured at the max value of VS as a ratio of expected counts / actual counts
*
* @return As a positive number only the supply rail voltage
*
* STEP 1: Calculate the mean of the ADC Supply rail counts
* STEP 2: Apply the error terms
* STEP 3: Using the mean value calculate supply rail according to input divider ratio
********************************************************************************************************/
static double calculateSystemSupply(Type_16b_FIFO *FIFO_SupplyRail, uint8_t InputOffsetError, double GainError)
{
    // STEP 1: Calculate the mean of the ADC Supply rail counts
    double MeanSupplyRailCount = (double)((double)FIFO_SupplyRail->Sum / FIFO_SupplyRail->Depth);

    // STEP 2: Apply the error terms
    double ErrorCompensatedCount = (MeanSupplyRailCount - InputOffsetError) / GainError;

    // STEP 3: Using the mean value calculate supply rail according to input divider ratio
    double SupplyRailVoltage = ErrorCompensatedCount * LSB_12BIT_VALUE * System_ADC_Reference * SYSTEM_VS_DIVIDER;
    return(SupplyRailVoltage);

} // END OF calculateSystemSupply



/********************************************************************************************************
* @brief Calculates the CHANNEL mean, max, min and RMS current.  The RMS value is used in the PID control
* of Constant Current Mode at the point of measure.  As such its accuracy needs to be right.  The RMS is
* a true RMS it is calculated by the formula RMS = sqrt(1/N * Sum(x*x)).
*
* An ADC offset error and gain error are channel specific measurements that are made to improve the overall
* accuracy of the ADC count reading.  The offset error is measure in ADC counts when the input to the ADC
* is at GND - ideally it should be 0, but if not, this is how many counts the ADC is offset by and therefore
* must be subtracted out.  The gain error relates more to quantization effects of the ADC.  It is measure at the
* highest ADC input possible (System Reference Voltage if possible, but certainly as large as you can get)
* and its value should ideally be 4096 (12b ADC) if input is System Reference Voltage or the expected calculated
* value. The Gain Error (GE) is calculated as Measured / Expected - no gain error would be a value of 1.0
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
* @note: TODO It was necessary to set the offset and gain errors to 0 and 1 (basically no errors) or PID would not work - needs to be investigated when time permits
*
* @param ADC_AmpMonitorCount: ADC Count from ADC channel for the specific current monitor
* @param FIFO_AmpMon: FIFO structure associated with the specific Amp Monitor channel
* @param Channel: ArbPwrBooster current measure struct associated with the specific channel
* @param RMS_AmpMon: Associated RMS structure
* @param InputOffsetError: The ADC input offset error measured in ADC counts 0 - indicates there is no measured offset
* @param GainError: The ADC gain error it is the unit-less ratio of the actual ADC count value at max divide by the calculated count value
*
* STEP 1: Calculate the mean of the Current Monitor
* STEP 2: Calculate the instantaneous current
* STEP 3: Update Min current or reset min if so desired
* STEP 4: Update Max current or reset max if so desired
* STEP 5: Calculate the RMS current
********************************************************************************************************/
static void calculateChannelCurrent(double ADC_AmpMonitorCount, Type_16b_FIFO *FIFO_AmpMon, Type_ChannelConfig *Channel, Type_RMS *RMS_AmpMon, uint8_t InputOffsetError, double GainError)
{
    double AmpMonitorCurrent = 0;

    if (Channel->OutputSwitch == ON)
    {
        // STEP 1: Calculate the mean of the Current Monitor
        double MeanCurrentCount = (double)FIFO_AmpMon->Sum / FIFO_AmpMon->Depth;
        double ErrorCompensatedCount = (MeanCurrentCount - InputOffsetError) / GainError;
        double MeanDiffVolt = ((ErrorCompensatedCount * LSB_12BIT_VALUE * System_ADC_Reference) - (Channel->Measure.ZeroCurrentVoltage)) / (AMP_MONITOR_GAIN);
        Channel->Measure.MeanCurrent = MeanDiffVolt / AMP_SENSE_RESISTOR;

        // STEP 2: Calculate the instantaneous current
        ErrorCompensatedCount = (ADC_AmpMonitorCount - InputOffsetError) / GainError;
        ErrorCompensatedCount -= (Channel->Measure.ZeroCurrentVoltage * ADC_12BIT_FULL_COUNT) / System_ADC_Reference;
        double DiffVolt = ((ErrorCompensatedCount * LSB_12BIT_VALUE * System_ADC_Reference) - (InputOffsetError)) / (GainError);
        AmpMonitorCurrent = DiffVolt / AMP_SENSE_RESISTOR;
    }
    else
    {
        Channel->Measure.MeanCurrent = 0;
        Channel->Measure.RMS_Current = 0;
        return;
    }

    // STEP 3: Update Min current or reset min if so desired
    if (Channel->Measure.ResetCurrentMinMax)
        Channel->Measure.MinCurrent = AmpMonitorCurrent;
    else if (AmpMonitorCurrent < Channel->Measure.MinCurrent)
        Channel->Measure.MinCurrent = AmpMonitorCurrent;

    // STEP 4: Update Max current or reset max if so desired
    if (Channel->Measure.ResetCurrentMinMax)
    {
        Channel->Measure.MaxCurrent = AmpMonitorCurrent;
        Channel->Measure.ResetCurrentMinMax = false;
    }
    else if (AmpMonitorCurrent > Channel->Measure.MaxCurrent)
    {
        Channel->Measure.MaxCurrent = AmpMonitorCurrent;
    }

    // STEP 5: Calculate the RMS current
    Channel->Measure.RMS_Current = Channel->Measure.RMS_CurrentFunction(RMS_AmpMon, AmpMonitorCurrent);
    if (Channel->Measure.RMS_Current < RMS_TO_MEAN_THREHOLD)
        Channel->Measure.RMS_Current = fabs(Channel->Measure.MeanCurrent);

