habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
} // END OF calculateChannelCurrent



/********************************************************************************************************
* @brief Calculates the CHANNEL mean, max, min and RMS voltage.  See notes on function calculateChannelCurrent
*
* An ADC offset error and gain error are channel specific measurements that are made to improve the overall
* accuracy of the ADC count reading.  The offset error is measure in ADC counts when the input to the ADC
* is at GND - ideally it should be 0, but if not, this is how many counts the ADC is offset by and therefore
* must be subtracted out.  The gain error relates more to quantization effects of the ADC.  It is measure at the
* highest ADC input possible (System Reference Voltage if possible, but certainly as large as you can get)
* and its value should ideally be 4096 (12b ADC) if input is System Reference Voltage or the expected calculated
* value. The Gain Error (GE) is calculated as Measured / Expected - no gain error would be a value of 1.0
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @param ADC_VoltMonitorCount: ADC Count from ADC channel for the specific voltage monitor
* @param FIFO_VoltMon: FIFO structure associated with the specific Volt Monitor channel
* @param Channel: ArbPwrBooster current measure struct associated with the specific channel
* @param RMS_VoltMon: Associated RMS structure
* @param InputOffsetError: The ADC input offset error measured in ADC counts 0 - indicates there is no measured offset
* @param GainError: The ADC gain error it is the unit-less ratio of the actual ADC count value at max divide by the calculated count value
*
* STEP 1: Calculate the mean of the Voltage Monitor
* STEP 2: Calculate the instantaneous voltage
* STEP 3: Update Min voltage or reset min if so desired
* STEP 4: Update Max voltage or reset max if so desired
* STEP 5: Calculate the RMS voltage
********************************************************************************************************/
static void calculateChannelVoltage(double ADC_VoltMonitorCount, Type_16b_FIFO *FIFO_VoltMon, Type_ChannelConfig *Channel, Type_RMS *RMS_VoltMon, uint8_t InputOffsetError, double GainError)
{
    // TODO Think about a periodic min max reset
    // STEP 1: Calculate the mean of the Voltage Monitor
    double MeanVoltageCount = (double)FIFO_VoltMon->Sum / FIFO_VoltMon->Depth;
    double ErrorCompensatedCount = (MeanVoltageCount - InputOffsetError) / GainError;
    Channel->Measure.MeanVoltage = ErrorCompensatedCount * LSB_12BIT_VALUE * System_ADC_Reference * VOLT_MON_DIVIDER;

    // STEP 2: Calculate the instantaneous voltage
    ErrorCompensatedCount = (ADC_VoltMonitorCount - InputOffsetError) / GainError;
    double VoltMonitorVoltage = ErrorCompensatedCount * LSB_12BIT_VALUE * System_ADC_Reference * VOLT_MON_DIVIDER;

    // STEP 3: Update Min voltage or reset min if so desired
#ifdef CAL_MIN_MAX_VOLTAGE
    if (Channel->Measure.ResetVoltageMinMax)
        Channel->Measure.MinVoltage = VoltMonitorVoltage;
    else if (VoltMonitorVoltage < Channel->Measure.MinVoltage)
        Channel->Measure.MinVoltage = VoltMonitorVoltage;

    // STEP 4: Update Max voltage or reset max if so desired
    if (Channel->Measure.ResetVoltageMinMax)
    {
        Channel->Measure.MaxVoltage = VoltMonitorVoltage;
        Channel->Measure.ResetVoltageMinMax = false;
    }
    else if (VoltMonitorVoltage > Channel->Measure.MaxVoltage)
    {
        Channel->Measure.MaxVoltage = VoltMonitorVoltage;
    }
#endif

    // STEP 5: Calculate the RMS voltage
    Channel->Measure.RMS_Voltage = Channel->Measure.RMS_VoltageFunction(RMS_VoltMon, VoltMonitorVoltage);

} // END OF calculateChannelVoltage



/********************************************************************************************************
* @brief Pre-actions to be performed before monitorTaskActions - These actions are performed only once.
*
* @author original: Hab Collector \n
*
********************************************************************************************************/
void monitorTaskInit(void)
{
    DO_NOTHING();

} // END OF monitorTaskInit



/********************************************************************************************************
* @brief Task monitors and controls device actions for error conditions in VS System Supply rails, over temperature,
* out of tolerance 3V3, PID control of Constant Current operation for channel 1 and 2 and Fan 1 and 2 control.
*
* @author original: Hab Collector \n
*
* @note This is where PID control occurs
*
* STEP 1: Do nothing until introduction splash screen completed
* STEP 2: Do nothing if a system error has occurred
* STEP 3: Check that VS supply within limits - if not disable input
* STEP 4: Check for current limit CH 1 - Constant Current Mode
* STEP 5: Check for current limit CH 2 - Constant Current Mode
* STEP 6: Check for critical system error conditions
* STEP 7: Make task inactive for a period of time
********************************************************************************************************/
void monitorTaskActions(void)
{
    static bool CriticalSystemError = false;
    static uint8_t LastPotValue = MCP45HVX1_POT_FULL_RESOLUTION;

    // STEP 1: Do nothing until introduction splash screen completed
    if (ArbPwrBooster.Ready)
    {
        // STEP 2: Do nothing if a system error has occurred
        if (!CriticalSystemError)
        {
            // STEP 3: Check that VS supply within limits - if not disable input
            char NotUsedStatusMsg[25] = {0x00};
            uint8_t ConfigError = 0;
            systemMeasureWithinLimits(NotUsedStatusMsg, &ConfigError);
            // TODO: Hab needs work - IR losses on VS input lines causes this to fail - adjust VS limit error
            if ((ConfigError & CONFIG_POS_VS_ERROR) || (ConfigError & CONFIG_NEG_VS_ERROR))
            {
                CH1_INPUT_DISABLE();
                CH2_INPUT_DISABLE();
            }
            else
            {
                CH1_INPUT_ENABLE();
                CH2_INPUT_ENABLE();
            }

            // STEP 4: Check for current limit CH 1 - Constant Current Mode
            if ((ArbPwrBooster.CH1.OutputSwitch == ON) && (ArbPwrBooster.CH1.Limit.Enable))
            {
#ifdef PRINT_CC_PID_UPDATES
                static uint16_t TickCount = 0;
                static uint16_t DataUpdateCount = 0;
                static bool PrintColumnHeader = true;
                TickCount++;
#endif
                if (PID_updateDigitalPot(ArbPwrBooster.CH1.PID, ArbPwrBooster.CH1.Measure.RMS_Current, ArbPwrBooster.CH1.Limit.Current, (MONITOR_UPDATE_RATE * 1E-3)) == PID_UPDATE)
                {
                    if (LastPotValue != ArbPwrBooster.CH1.PID->PotStep)
                    {
                        MCP45HVX1_WriteWiperVerify(&hi2c1, A1A0_EXTERNAL_ADDR_CH1, ArbPwrBooster.CH1.PID->PotStep);
                        LastPotValue = ArbPwrBooster.CH1.PID->PotStep;
#ifdef PRINT_CC_PID_UPDATES
                        if (PrintColumnHeader)
                        {
                            printf("\r\n\n#\tTick\tStep\tIrms\r\n");
                            fflush(stdout);
                            PrintColumnHeader = false;
                        }
                        DataUpdateCount++;
                         char PrintMsg[100];
                        sprintf(PrintMsg, "%d\t%d\t%d\t%2.3f\r\n", DataUpdateCount, TickCount, ArbPwrBooster.CH1.PID->PotStep, ArbPwrBooster.CH1.Measure.RMS_Current);
                        printGreen(PrintMsg);
#endif
                    }
                }
            }
            else
            {
#ifdef PRINT_CC_PID_UPDATES
                TickCount = 0;
                DataUpdateCount = 0;
                PrintColumnHeader = true;
#endif
            }

            // STEP 5: Check for current limit CH 1 - Constant Current Mode
            // TODO: Hab add step 5 for channel 2


