habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
            // STEP 6: Check for critical system error conditions
            // TODO: Hab this can be combined with STEP 2 - seems redundant here
            // Over Voltage on ±VS supply
            if ((ArbPwrBooster.SystemMeasure.Positive_VS >= SYSTEM_POS_VS_LIMIT) || (ArbPwrBooster.SystemMeasure.Negative_VS <= SYSTEM_NEG_VS_LIMIT))
            {
                CriticalSystemError = true;
                MAIN_PWR_OFF();
                printBrightRed("\r\nERROR: Critical on VS supply rail\r\n");
                printBrightRed("Correct supply rail then reset\r\n");
            }
            // Over Temperature
            if (ArbPwrBooster.SystemMeasure.TempDegreeC >= SYSTEM_TEMP_UPPER_LIMIT)
            {
                CriticalSystemError = true;
                MAIN_PWR_OFF();
                printBrightRed("\r\nERROR: Critical over temperature\r\n");
                printBrightRed("Cool device then reset\r\n");
            }
        }
    }

//    uint8_t static PrintCount = 0;
//    if (ArbPwrBooster.CH1.OutputSwitch == ON)
//    {
//        PrintCount++;
//        if (PrintCount >= 20)
//        {
//    //        printf("%d\t%2.3f\%2.3f\r\n", TestCount, AmpMonitorCurrent, Channel->Measure.RMS_Current);
//            printf("%2.3f\r\n", (float)FIFO_CH1_AmpMon->Sum / 16.0);
//            fflush(stdout);
//            PrintCount = 0;
//        }
//    }

    // STEP 7: Make task inactive for a period of time
    osDelay(MONITOR_UPDATE_RATE);



} // END OF monitorTaskActions



/********************************************************************************************************
* @brief ADC1 is configured for DMA single shot conversion mode.  At the end of each conversion the ADC must
* be restarted for the next conversion.  Issue this command to start a conversion.  When the conversion is
* completed the results will be handled in HAL_ADC_ConvCpltCallback().  As this is single shot, you must call
* this function at the end of conversion if you want another conversion - and so on and so on.
*
* @author original: Hab Collector \n
*
* STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
********************************************************************************************************/
void ADC1_StartConversion(void)
{
    // STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
    HAL_ADC_Start_DMA(&hadc1, (uint32_t *)ADC1_CountValue, ADC1_NUMBER_OF_CHANNELS);

}  // END OF ADC1_StartConversion



/********************************************************************************************************
* @brief Checks the system values of +VS, -VS, Temperature and Vref to see if they are within the specified
* limits of operation.  All errors are OR together to the error variable, but only the first error description
* is returned.
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @param ErrorDescription: Returned by reference a description of the error
* @param ErrorNumber: Returned by reference the error number
*
* @return True if no config errror found otherwise returns false
*
* STEP 1: Check System +VS
* STEP 2: Check System -VS
* STEP 3: Check System Vref
* STEP 4: Check System Temperature
* STEP 5: For no error
********************************************************************************************************/
bool systemMeasureWithinLimits(char *ErrorDescription, uint8_t *ErrorNumber)
{
    bool FirstErrorFound = false;
    *ErrorNumber = CONFIG_NO_ERROR;

    // STEP 1: Check System +VS
    if ((ArbPwrBooster.SystemMeasure.Positive_VS > SYSTEM_POS_VS_HIGH) || (ArbPwrBooster.SystemMeasure.Positive_VS < SYSTEM_POS_VS_LOW))
    {
        *ErrorNumber |= (1 << CONFIG_POS_VS_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "+VS: %3.1fV to %3.1fV", SYSTEM_POS_VS_LOW, SYSTEM_POS_VS_HIGH);
            FirstErrorFound = true;
        }
    }

    // STEP 2: Check System -VS
    if ((ArbPwrBooster.SystemMeasure.Negative_VS > SYSTEM_NEG_VS_HIGH) || (ArbPwrBooster.SystemMeasure.Negative_VS < SYSTEM_NEG_VS_LOW))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_NEG_VS_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "-VS: %3.1fV to %3.1fV", SYSTEM_NEG_VS_LOW, SYSTEM_NEG_VS_HIGH);
            FirstErrorFound = true;
        }
    }

    // STEP 3: Check System Vref
    if ((ArbPwrBooster.SystemMeasure.VDD_VDREF > SYSTEM_3V3_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.VDD_VDREF < SYSTEM_3V3_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_VREF_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "VREF: %4.3fV to %4.3fV", SYSTEM_3V3_LOWER_LIMIT, SYSTEM_3V3_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 4: Check System Temperature
    // TODO: Hab you only care about an upper limit not a lower
    if ((ArbPwrBooster.SystemMeasure.TempDegreeC >= SYSTEM_TEMP_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.TempDegreeC <= SYSTEM_TEMP_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_TEMP_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "%dC < Temp < %dC", SYSTEM_TEMP_LOWER_LIMIT, SYSTEM_TEMP_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 5: For no error
    if (*ErrorNumber == CONFIG_NO_ERROR)
    {
        sprintf(ErrorDescription, "I'm good how about you.");
        return(true);
    }
    else
    {
        return(false);
    }

} // END OF systemMeasureWithinLimits



/********************************************************************************************************
* @brief When no current flows through the sense resistor the actual measured current should be zero Amps.
* This value in volts should be the current shunt monitor IC reference voltage.  The reference voltage is 1/2
* 3.3V (VREF) = 1.650V.  To account for inaccuracies in the system this function should be called when the
* output is disconnected (no current flowing) to establish the true reference for 0 Amp current flow.
*
* @author original: Hab Collector \n
*
* @note: ***This function should only be called when the channel output is switched off - no current flow
* @note: If called when the output is switched on the default value (1.650V) is used with a false return
*
* @param Channel: Should be CHANNEL_1 or CHANNEL_2
*
* @return True with the ArbPwrBooster struct member ZeroCurrentVoltage set to the value when output is off
*
* STEP 1: CH 1: Set the zero offset voltage (the present mean value) if channel is switched off
* STEP 2: CH 2: Set the zero offset voltage (the present mean value) if channel is switched off
********************************************************************************************************/
bool updateAmpMonitorZeroVoltage(Type_Channel Channel)
{
    if (Channel == CHANNEL_1)
    {
        // STEP 1: CH 1: Set the zero offset voltage (the present mean value) if channel is switched off
        if (ArbPwrBooster.CH1.OutputSwitch == OFF)
        {
            double MeanCount_ADC = (double)FIFO_CH1_AmpMon->Sum / FIFO_CH1_AmpMon->Depth;
            ArbPwrBooster.CH1.Measure.ZeroCurrentVoltage = MeanCount_ADC * LSB_12BIT_VALUE * System_ADC_Reference;
            return(true);
        }
        else
        {
            ArbPwrBooster.CH1.Measure.ZeroCurrentVoltage = CURRENT_MON_ZERO_OFFSET;
            return(false);
        }
    }
    else
    {
        // STEP 2: CH 2: Set the zero offset voltage (the present mean value) if channel is switched off
        if (ArbPwrBooster.CH2.OutputSwitch == OFF)
        {
            double MeanCount_ADC = (double)FIFO_CH2_AmpMon->Sum / FIFO_CH2_AmpMon->Depth;
            ArbPwrBooster.CH2.Measure.ZeroCurrentVoltage = MeanCount_ADC * LSB_12BIT_VALUE * System_ADC_Reference;
            return(true);
        }
        else
        {
            ArbPwrBooster.CH2.Measure.ZeroCurrentVoltage = CURRENT_MON_ZERO_OFFSET;
            return(false);
        }
    }

} // END OF updateAmpMonitorZeroVoltage





